[
    {
        "word": "Ecologists",
        "definition": "Scientists who study the relationships between organisms and their environments."
    },
    {
        "word": "Nest spacing",
        "definition": "The distance between nests within a colony or among different colonies."
    },
    {
        "word": "Stingless bees",
        "definition": "A type of bee known for not having the ability to sting, distinct from more common stinging varieties."
    },
    {
        "word": "Rival colonies",
        "definition": "Groups of the same species that compete against each other for resources such as nesting sites."
    },
    {
        "word": "Forage",
        "definition": "The act of searching for food in the environment."
    },
    {
        "word": "High-density clumps",
        "definition": "Areas where resources, like flowers, are concentrated and plentiful."
    },
    {
        "word": "Colony distribution",
        "definition": "The spatial arrangement of animal colonies within an area."
    },
    {
        "word": "Clumped distribution",
        "definition": "An arrangement where objects or points are grouped together, forming clusters."
    },
    {
        "word": "Pheromones",
        "definition": "Chemical substances produced and released into the environment by an animal, affecting the behavior or physiology of others of its species."
    },
    {
        "word": "Escalated",
        "definition": "To increase in intensity or magnitude, used here to describe fights that grow more intense over time."
    },
    {
        "word": "Protracted battles",
        "definition": "Extended conflicts that last a significant amount of time."
    },
    {
        "word": "Ritualized",
        "definition": "Actions or behaviors that are formalized and follow a set pattern or convention, often with symbolic meaning."
    },
    {
        "word": "Mortality",
        "definition": "Death within a population; in this case, bees dying as a result of fights."
    }

]