[
    {
        "word": "Meteor",
        "definition": "A small body of matter from outer space that enters Earth's atmosphere, becoming incandescent as a result of friction."
    },
    {
        "word": "Meteorite",
        "definition": "A meteor that survives its passage through the earth's atmosphere such that part of it strikes the ground."
    },
    {
        "word": "Glassy crust",
        "definition": "A smooth, glass-like surface that forms on meteorites as their exteriors melt during atmospheric entry."
    },
    {
        "word": "Matrix",
        "definition": "Here, it refers to the binding material in which smaller objects are embedded within a meteorite."
    },
    {
        "word": "Solar nebula",
        "definition": "The cloud of gas and dust from which the solar system was formed."
    },
    {
        "word": "Chondrite",
        "definition": "A type of stony meteorite containing small mineral grains called chondrules."
    },
    {
        "word": "Chondros",
        "definition": "Greek for \"seed\", used metaphorically to describe the appearance of chondrules in chondrites."
    },
    {
        "word": "Chondrules",
        "definition": "Small, round particles in meteorites, formed from once-molten droplets of silicate."
    },
    {
        "word": "Silicate",
        "definition": "Minerals composed of silicon and oxygen, often with additional metals."
    },
    {
        "word": "Refractory inclusions",
        "definition": "Components of a meteorite that are resistant to heat and melting, containing high concentrations of certain minerals."
    },
    {
        "word": "Condensed",
        "definition": "Changed from a gas to a solid or liquid state; here it refers to the process by which minerals form from the solar nebula."
    },
    {
        "word": "Theoretical condensation sequence",
        "definition": "The predicted order in which minerals would solidify from a cooling gas, based on their chemical properties."
    },
    {
        "word": "Iron sulfide",
        "definition": "A compound of iron and sulfur, often found in meteoritic material."
    },
    {
        "word": "Nebular",
        "definition": "Related to a nebula, which in this context is the cloud of material from which the solar system formed."
    },
    {
        "word": "Interstellar dust",
        "definition": "Dust that originates outside our solar system but is found within it, often in nebulae."
    },
    {
        "word": "Chondritic meteorites",
        "definition": "Meteorites that contain chondrules and have a composition similar to that of the sun, except for volatile elements."
    },
    {
        "word": "Elemental ratios",
        "definition": "Comparisons of the amounts of different elements, used to study the composition of celestial objects."
    },
    {
        "word": "Volatile elements",
        "definition": "Chemical elements that can easily vaporize or form gases at relatively low temperatures."
    },
    {
        "word": "Distilled Sun",
        "definition": "Metaphorically describes chondrites as being like a refined version of the sun, having lost only the most volatile components."
    },
    {
        "word": "Solar sludge",
        "definition": "Another metaphor suggesting that chondrites are like the sun's residue after gases have been removed."
    },
    {
        "word": "Nebular matter",
        "definition": "The substance that makes up a nebula; in this context, it relates to the material from which the solar system was formed."
    }
]