[
    {
        "word": "Plate tectonics",
        "definition": "Theory describing the motion of Earth's lithosphere, involved in geological phenomena like earthquakes and mountain building."
    },
    {
        "word": "Continental drift",
        "definition": "Movement of Earth's continents over geological time."
    },
    {
        "word": "Geothermal energy",
        "definition": "Heat from Earth's interior used for heating and power generation."
    },
    {
        "word": "Subsurface region",
        "definition": "Area below the Earth's surface, particularly where heat reservoirs are located."
    },
    {
        "word": "Geologic structure",
        "definition": "The arrangement of rock formations underground, such as the Paris Basin."
    },
    {
        "word": "Molten rock material",
        "definition": "Liquid rock beneath Earth's surface, a heat source for high-temperature geothermal reservoirs."
    },
    {
        "word": "Facility",
        "definition": "A place equipped for a particular purpose, like a geothermal power plant."
    },
    {
        "word": "Rift valleys",
        "definition": "Large depressions formed by the displacement of the Earth's crust, potential geothermal sites."
    },
    {
        "word": "Harness",
        "definition": "To utilize, often referring to natural resources for energy."
    },
    {
        "word": "Naturally occurring groundwater",
        "definition": "Water found naturally underground, used in geothermal processes."
    },
    {
        "word": "Seeps down",
        "definition": "Gradual movement of water into deeper geological layers."
    },
    {
        "word": "Drilled",
        "definition": "Bored into, often for creating access to underground resources."
    },
    {
        "word": "Present a disposal problem",
        "definition": "Indicate a challenge with managing waste, such as contaminated water from geothermal plants."
    },
    {
        "word": "Heat Reservoir",
        "definition": "An underground area storing significant heat, crucial for the operation of geothermal systems."
    }
]
