[
    {
        "word": "Metabolism",
        "definition": "Typically a biological term, it's used metaphorically here to describe the city's conversion and processing of energy and materials."
    },
    {
        "word": "Sewage",
        "definition": "Waste water and excrement conveyed in sewers."
    },
    {
        "word": "Air pollutants",
        "definition": "Substances in the air that can cause harm to humans and the environment."
    },
    {
        "word": "Urban heat island",
        "definition": "A metropolitan area that is significantly warmer than its surrounding rural areas due to human activities."
    },
    {
        "word": "Insulated",
        "definition": "Materials or structures that prevent the transfer of heat."
    },
    {
        "word": "Radiant heat",
        "definition": "Heat that is transmitted in the form of rays or waves."
    },
    {
        "word": "Shortwave radiation",
        "definition": "A type of radiation, including visible light, which has a short wavelength and is capable of penetrating the atmosphere."
    },
    {
        "word": "Longwave radiation",
        "definition": "Radiation emitted in the infrared spectrum, typically associated with heat emitted from the Earth."
    },
    {
        "word": "Gaseous pollutants",
        "definition": "Airborne pollutants that exist in gaseous form, often contributing to environmental issues like smog and acid rain."
    },
    {
        "word": "Climatic peculiarities",
        "definition": "Unique or unusual climate characteristics that are specific to a particular area."
    },
    {
        "word": "Impenetrable",
        "definition": "Not able to be passed through or entered."
    },
    {
        "word": "Evaporation",
        "definition": "The process of turning from liquid into vapor."
    },
    {
        "word": "Air turbulence",
        "definition": "Unsteady, irregular air movement characterized by small, rapid changes in pressure and velocity."
    },
    {
        "word": "Skyscrapers",
        "definition": "Very tall buildings, often found in cities, which can influence local air flow and climate conditions."
    }
]