[
    {
        "word": "Camera obscura",
        "definition": "A darkened box with a lens or hole for projecting the image of an external object onto a surface inside. It was a precursor to the photographic camera."
    },
    {
        "word": "Topographical artists",
        "definition": "Artists who specialize in detailed and accurate representation of a particular area, often focusing on landscape and cityscape scenes."
    },
    {
        "word": "Daguerreotype",
        "definition": "An early type of photograph created by Louis Daguerre, which fixed an image directly onto a silvered copper plate."
    },
    {
        "word": "Calotype",
        "definition": "A photographic process developed by William Henry Talbot that used paper coated with silver iodide. It was significant for being the first negative-to-positive process, allowing multiple copies of an image to be made."
    },
    {
        "word": "Chemically treated paper",
        "definition": "Paper that has been treated with chemicals to make it sensitive to light, used in the calotype process."
    },
    {
        "word": "Negative image",
        "definition": "An image where the light and dark areas are reversed, used in traditional photographic processes to produce the final positive image."
    },
    {
        "word": "Authenticity",
        "definition": "The quality of being genuine or true. In the context of early photography, it refers to the medium's ability to capture scenes with minimal human interference, considered more 'authentic' than art."
    },
    {
        "word": "Portrait miniature",
        "definition": "Small hand-painted portraits that were popular before the advent of photography."
    },
    {
        "word": "Democratic",
        "definition": "In this context, it means making something accessible to a broader segment of society. Photography democratized the availability of portraiture."
    },
    {
        "word": "Prolific",
        "definition": "Producing a lot of something. Used here to describe the vast amount of images that could be created through photography."
    },
    {
        "word": "Emulsions",
        "definition": "Light-sensitive substances used in photographic films."
    },
    {
        "word": "Candid photography",
        "definition": "A style of photography where subjects are captured without their knowledge, leading to natural and unposed images."
    },
    {
        "word": "Radical cropping",
        "definition": "The act of cutting out parts of photographs to focus on certain details or to frame the subject in a particular way, often leading to innovative compositions in both photography and painting."
    }
]
