[
    {
        "word": "Millennium B.C.E.",
        "definition": "Refers to a thousand-year period before the Common Era, commonly used in historical and archaeological contexts."
    },
    {
        "word": "Escalation",
        "definition": "An increase or intensification of actions or phenomena. In the context of the article, it refers to the significant growth in the area occupied by permanent settlements in southern Mesopotamia, particularly around the city of Uruk. This term highlights the rapid development and expansion of urban centers during that period."
    },
    {
        "word": "Utilitarian pottery",
        "definition": "Functional ceramic ware intended for everyday use rather than decorative purposes."
    },
    {
        "word": "Beveled-rim bowl",
        "definition": "A specific type of ancient pottery characterized by its angled rim, indicative of certain historical periods or cultural practices."
    },
    {
        "word": "Diagnostic finds",
        "definition": "Artifacts or evidence that are emblematic of particular archaeological contexts or time periods."
    },
    {
        "word": "Cylinder seal",
        "definition": "A small, cylindrical object used to roll an imprint onto soft materials, crucial in ancient administrative and security practices."
    },
    {
        "word": "Faience",
        "definition": "A glazed ceramic material, often used in decorative arts or small-scale sculptures."
    },
    {
        "word": "Relief",
        "definition": "A sculptural technique where the sculpted elements remain attached to a solid background, creating a raised effect."
    },
    {
        "word": "Statuary in the round",
        "definition": "Free-standing sculptures carved or modeled in three dimensions, showcasing advanced artistic skills."
    },
    {
        "word": "Monumental art",
        "definition": "Large-scale art forms, such as sculptures or reliefs, intended to last and often serving ceremonial or commemorative purposes."
    },
    {
        "word": "Professional mastery",
        "definition": "A high level of skill and expertise in a particular craft or field, typically achieved through extensive training and experience."
    }
]
