[
    {
        "word": "Deciduous",
        "definition": "Describes a plant that sheds its leaves annually, which is typical of some but not all plant species in temperate zones."
    },
    {
        "word": "Perennial",
        "definition": "A plant that lives for more than two years, typically regenerating each growing season."
    },
    {
        "word": "Intertidal zone",
        "definition": "The area along a shoreline that is covered by water at high tide and exposed during low tide."
    },
    {
        "word": "Excrete",
        "definition": "To pass waste materials from the body; in the context of the ecosystem, it refers to the process by which organisms eliminate waste that can still be nutrient-rich."
    },
    {
        "word": "Subtidal organisms",
        "definition": "Marine organisms that live below the low tide mark, continuously submerged underwater."
    },
    {
        "word": "Underground stems",
        "definition": "Also known as rhizomes, these are a type of stem that grows horizontally underground and helps in vegetative reproduction."
    },
    {
        "word": "Substrates",
        "definition": "The underlying surface or medium that provides the foundation for organisms; in this context, it refers to sand, silt, gravel, or cobble."
    },
    {
        "word": "Salinities",
        "definition": "The concentration of salt in water, significant for plants like Spartina that grow in saline environments."
    },
    {
        "word": "Sulfides",
        "definition": "Chemical compounds containing sulfur that are typically found in marsh sediments and can be toxic to most plants."
    },
    {
        "word": "Estuaries",
        "definition": "Bodies of water found at the junction where rivers meet the sea, often rich in nutrients and biodiversity."
    },
    {
        "word": "Sediment trap",
        "definition": "A natural or artificial feature that catches and holds sediment, helping to stabilize an area by accumulating soil."
    },
    {
        "word": "Brackish water",
        "definition": "Water that has more salinity than fresh water, but not as much as seawater, often found in estuaries."
    },
    {
        "word": "Erosion",
        "definition": "The process by which soil and rock are removed from the Earth's surface by natural processes such as wind or water flow."
    },
    {
        "word": "Transplanted",
        "definition": "Moved or transferred to a new location, often referring to plants or animals moved by humans."
    },
    {
        "word": "Inhospitable",
        "definition": "Not suitable for living; used to describe environments that are not conducive to certain forms of life."
    },
    {
        "word": "Land reclamation",
        "definition": "The process of creating new land from ocean, riverbeds, or lake beds."
    },
    {
        "word": "Herbicide",
        "definition": "A type of chemical substance used to kill unwanted plants or weeds."
    }
]
